app/controllers/store_controller.rb

  def index
    if params[:set_locale]
      redirect_to store_path(locale: params[:set_locale])
    else
      @products = Product.order(:title)
      @cart = current_cart
    end

    latest = Product.latest
---
SELECT "products".* FROM "products" ORDER BY title
SELECT "products".* FROM "products" ORDER BY updated_at desc LIMIT 1